In [1687]:
import sqlite3
con = sqlite3.connect('db')

In [1688]:
import pandas as pd

In [1689]:
sqlite3.sqlite_version

'3.39.4'

In [1690]:
df = pd.read_csv('database/german_credit_augmented.csv')
df.head()

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,NaN,NaN,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,NaN,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,NaN,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,NaN,776,12,radio/TV,0,2007-07-21 13:22:14,358

In [1691]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'], format='%Y-%m-%d %H:%M:%S')

In [1692]:
df.dtypes

age                          int64
sex                         object
job                          int64
housing                     object
saving_accounts             object
checking_account            object
credit_amount                int64
duration                     int64
purpose                     object
default                      int64
contract_dt         datetime64[ns]
client_id                    int64
dtype: object

In [1693]:
df.to_sql('german_credit', con, index=False, if_exists='replace')

1000

In [1694]:
def select(sql):
    return pd.read_sql(sql, con)

In [1695]:
sql = '''select t.* from german_credit t limit 10'''

In [1696]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
5,27,female,2,own,little,moderate,1295,18,furniture/equipment,0,2008-06-18 04:10:05,86
6,29,female,2,own,little,moderate,959,9,furniture/equipment,1,2007-05-21 14:32:00,351
7,42,female,2,rent,rich,rich,409,12,radio/TV,0,2008-06-05 05:31:13,27
8,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
9,55,male,2,free,rich,None,1555,12,repairs,1,2007-09-11 20:27:28,754

In [1697]:
sql = '''select t.age from german_credit t limit 10'''

In [1698]:
select(sql)

   age
0   33
1   43
2   52
3   35
4   28
5   27
6   29
7   42
8   26
9   55

In [1699]:
sql = '''select t.age, t.job from german_credit t limit 10'''

In [1700]:
select(sql)

   age  job
0   33    2
1   43    1
2   52    2
3   35    3
4   28    2
5   27    2
6   29    2
7   42    2
8   26    2
9   55    2

In [1701]:
sql = '''select t.age * 3 as age_mult3, t.job from german_credit t limit 10'''

In [1702]:
select(sql)

   age_mult3  job
0         99    2
1        129    1
2        156    2
3        105    3
4         84    2
5         81    2
6         87    2
7        126    2
8         78    2
9        165    2

In [1703]:
sql = '''SELECT t.age * 2 AS age_mult3,
        t.job
        FROM german_credit t
        LIMIT 10'''

In [1704]:
select(sql)

   age_mult3  job
0         66    2
1         86    1
2        104    2
3         70    3
4         56    2
5         54    2
6         58    2
7         84    2
8         52    2
9        110    2

In [1705]:
sql = '''select t.* from german_credit t
where contract_dt between '2007-01-01' and '2007-12-31' '''

In [1706]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
1,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
2,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
3,29,female,2,own,little,moderate,959,9,furniture/equipment,1,2007-05-21 14:32:00,351
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
...,...,...,...,...,...,...,...,...,...,...,...,...
568,45,male,1,own,quite rich,None,1750,6,radio/TV,0,2007-05-25 13:59:51,551
569,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
570,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
571,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
572,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [1707]:
sql = '''select count(*) from german_credit t
where contract_dt between '2007-01-01' and '2007-12-31' '''

In [1708]:
select(sql)

   count(*)
0       573

In [1709]:
sql = '''select t.* from german_credit t
where contract_dt between '2007-01-01' and '2007-12-31'
order by contract_dt'''

In [1710]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,20,male,2,own,None,little,2996,24,furniture/equipment,1,2007-05-01 07:17:29,495
1,49,female,2,own,little,moderate,1092,12,radio/TV,0,2007-05-01 08:41:46,288
2,30,female,3,own,little,moderate,4795,36,radio/TV,0,2007-05-01 12:42:45,141
3,39,female,1,own,None,moderate,932,6,education,0,2007-05-01 20:28:44,215
4,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598
...,...,...,...,...,...,...,...,...,...,...,...,...
568,30,male,2,own,little,moderate,639,12,repairs,1,2007-12-28 17:09:43,127
569,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99
570,23,female,2,rent,little,little,2406,30,furniture/equipment,1,2007-12-29 20:14:30,359
571,35,male,1,own,little,None,2684,24,radio/TV,0,2007-12-30 00:40:33,256
572,31,female,1,own,little,None,1736,12,furniture/equipment,0,2007-12-30 13:29:15,995

In [1711]:
sql = '''select t.* from german_credit t
where contract_dt between '2007-01-01' and '2007-12-31'
order by contract_dt desc '''

In [1712]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,31,female,1,own,little,None,1736,12,furniture/equipment,0,2007-12-30 13:29:15,995
1,35,male,1,own,little,None,2684,24,radio/TV,0,2007-12-30 00:40:33,256
2,23,female,2,rent,little,little,2406,30,furniture/equipment,1,2007-12-29 20:14:30,359
3,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99
4,30,male,2,own,little,moderate,639,12,repairs,1,2007-12-28 17:09:43,127
...,...,...,...,...,...,...,...,...,...,...,...,...
568,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598
569,39,female,1,own,None,moderate,932,6,education,0,2007-05-01 20:28:44,215
570,30,female,3,own,little,moderate,4795,36,radio/TV,0,2007-05-01 12:42:45,141
571,49,female,2,own,little,moderate,1092,12,radio/TV,0,2007-05-01 08:41:46,288
572,20,male,2,own,None,little,2996,24,furniture/equipment,1,2007-05-01 07:17:29,495

In [1713]:
sql = '''select t.* from german_credit t
where contract_dt between '2007-01-01' and '2007-12-31'
and t.purpose = 'car'
order by contract_dt'''

In [1714]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598
1,36,male,2,own,little,moderate,884,18,car,1,2007-05-02 06:22:11,184
2,47,male,3,own,little,moderate,1209,6,car,1,2007-05-03 10:29:01,485
3,55,male,2,own,rich,None,1413,12,car,0,2007-05-05 06:35:11,209
4,75,male,3,free,little,little,6615,24,car,0,2007-05-06 09:37:45,330
...,...,...,...,...,...,...,...,...,...,...,...,...
177,37,male,2,free,None,moderate,12389,36,car,1,2007-12-21 00:06:27,563
178,43,male,2,rent,little,little,4843,12,car,1,2007-12-22 16:17:29,668
179,48,male,2,own,little,None,2134,9,car,0,2007-12-24 16:28:30,20
180,25,male,2,rent,moderate,moderate,1264,15,car,1,2007-12-28 08:38:58,979
181,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99

In [1715]:
sql = '''select t.* from german_credit t
where contract_dt between '2007-01-01' and '2007-12-31'
and t.purpose in ('car', 'repairs')
order by contract_dt'''

In [1716]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598
1,36,male,2,own,little,moderate,884,18,car,1,2007-05-02 06:22:11,184
2,47,male,3,own,little,moderate,1209,6,car,1,2007-05-03 10:29:01,485
3,55,female,0,free,little,little,1190,18,repairs,1,2007-05-05 00:14:17,429
4,55,male,2,own,rich,None,1413,12,car,0,2007-05-05 06:35:11,209
...,...,...,...,...,...,...,...,...,...,...,...,...
192,67,female,2,own,little,moderate,3872,18,repairs,0,2007-12-24 12:25:28,779
193,48,male,2,own,little,None,2134,9,car,0,2007-12-24 16:28:30,20
194,25,male,2,rent,moderate,moderate,1264,15,car,1,2007-12-28 08:38:58,979
195,30,male,2,own,little,moderate,639,12,repairs,1,2007-12-28 17:09:43,127
196,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99

In [1717]:
sql = '''select t.* from german_credit t
where contract_dt between '2007-01-01' and '2008-01-01'
and (t.purpose = 'car' or t.purpose = 'repairs')
order by contract_dt'''

In [1718]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,31,male,2,own,little,None,2775,18,car,1,2007-05-01 23:14:02,598
1,36,male,2,own,little,moderate,884,18,car,1,2007-05-02 06:22:11,184
2,47,male,3,own,little,moderate,1209,6,car,1,2007-05-03 10:29:01,485
3,55,female,0,free,little,little,1190,18,repairs,1,2007-05-05 00:14:17,429
4,55,male,2,own,rich,None,1413,12,car,0,2007-05-05 06:35:11,209
...,...,...,...,...,...,...,...,...,...,...,...,...
192,67,female,2,own,little,moderate,3872,18,repairs,0,2007-12-24 12:25:28,779
193,48,male,2,own,little,None,2134,9,car,0,2007-12-24 16:28:30,20
194,25,male,2,rent,moderate,moderate,1264,15,car,1,2007-12-28 08:38:58,979
195,30,male,2,own,little,moderate,639,12,repairs,1,2007-12-28 17:09:43,127
196,36,male,3,rent,None,moderate,7057,20,car,0,2007-12-29 16:10:08,99

In [1719]:
sql = '''select t.* from german_credit t
where t.sex like '%male'
'''

In [1720]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [1721]:
sql = '''select t.* from german_credit t
where (t.sex like '%male') and t.credit_amount > 1000
'''

In [1722]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
3,27,female,2,own,little,moderate,1295,18,furniture/equipment,0,2008-06-18 04:10:05,86
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
...,...,...,...,...,...,...,...,...,...,...,...,...
879,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
880,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
881,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
882,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
883,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [1723]:
sql = '''SELECT t.credit_amount,
         CASE WHEN t.credit_amount > 1000 THEN 1 ELSE 0 END AS is_credit_amount_more_than_1000,
         IIF(t.credit_amount > 1000, 1, 0) AS is_credit_amount2_more_than_1000
         FROM german_credit t;
'''

In [1724]:
select(sql)

,credit_amount,is_credit_amount_more_than_1000,is_credit_amount2_more_than_1000
0,3074,1,1
1,1344,1,1
2,936,0,0
3,1393,1,1
4,776,0,0
...,...,...,...
995,2600,1,1
996,4455,1,1
997,6403,1,1
998,5003,1,1
999,1804,1,1

In [1725]:
sql = '''SELECT t.credit_amount,
         avg(CASE WHEN t.credit_amount > 1000 THEN 1 ELSE 0 END) as greater_1000_frac
         FROM german_credit t;
'''

In [1726]:
select(sql)

   credit_amount  greater_1000_frac
0           3074              0.884

In [1727]:
sql = '''select t.* from german_credit t
where t.credit_amount > 1000'''

In [1728]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
3,27,female,2,own,little,moderate,1295,18,furniture/equipment,0,2008-06-18 04:10:05,86
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
...,...,...,...,...,...,...,...,...,...,...,...,...
879,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
880,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
881,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
882,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
883,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [1729]:
cur = con.cursor()

In [1730]:
sql = '''
drop table if exists greater_1000_credit;

create table greater_1000_credit as
select t.* from german_credit t
where t.credit_amount > 1000'''

In [1734]:
cur.executescript(sql)

In [1735]:
sql = '''select * from greater_1000_credit t'''

In [1736]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
3,27,female,2,own,little,moderate,1295,18,furniture/equipment,0,2008-06-18 04:10:05,86
4,26,male,2,own,little,little,4370,42,radio/TV,1,2007-11-29 00:20:44,639
...,...,...,...,...,...,...,...,...,...,...,...,...
879,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
880,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
881,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
882,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
883,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

In [1737]:
'''Union all'''

'Union all'

In [1738]:
jan = pd.DataFrame({'month':['jan','jan'],'revenue':[1,2]})
feb = pd.DataFrame({'month':['feb','feb'],'revenue':[1,2]})

In [1739]:
jan.to_sql('jan',con,index=False,if_exists='replace')
feb.to_sql('feb',con,index=False,if_exists='replace')

2

In [1740]:
sql = '''select * from jan t
union all
select * from feb t'''

In [1741]:
select(sql)

  month  revenue
0   jan        1
1   jan        2
2   feb        1
3   feb        2